import "./blog.css";
import {useNavigate} from "react-router-dom";

export default function Blog() {
    const navigate = useNavigate();

    const blogMap = [
        {
            img: "public/images/blogsIImages/lightbulb_character.png",
            title: "Մտածողության ճկունություն",
            desk: "Դուք կորցնում եք դիրքերը, \n" +
                "Երբ շուկան փոխվում է, իսկ Դուք իներցիայով հետևում եք հին սխեմաներին, Ոչ միայն ռիսկի եք դիմում, այլև զիջում եք ։ \n" +
                "Մի աշխարհում, որտեղ ամեն ինչ ավելի արագ է շարժվում, քան կարող եք հարմարվել, մեկ մոտեցման վրա մնալը նշանակում է բաց թողնել աճի հնարավորությունը: \n" +
                "Դուք կորցնում եք դիրքերը, երբ շարունակում եք անել նույնը՝ սպասելով այլ արդյունքի։ Դուք կորցնում եք ուժը, երբ հրաժարվում եք ընդունել.իրականությունը պահանջում է նոր լուծումներ: \n" +
                "Մտածողության ճկունությունը վերաբերում է ինքներդ Ձեզ հետ անկեղծ ,լինելու կարողությանը։ իրականության հետ կապի մեջ լինելու Ձեր կարողությանը։ Ընդունել, որ բարդ կառուցված պլանը նոր իրականության մեջ այլևս չի աշխատում, որ շուկան փոխվել է, որ հաճախորդները սպասում են ուրիշին։ Դա թուլություն չէ, այլ հասունություն, գործողությունների նոր որակ: \n" +
                "Մտածողության ճկունությունը վերաբերում է փաստին, որ ձեր բիզնեսը կենդանի է: Նա շնչում է, փոխվում և սովորում: Նա հարմարվում է ոչ թե գոյատևելու, այլ առաջինը լինելու համար։ Այնտեղ ուր մյուսները տեսնում են փակուղի, Դուք տեսնում եք հնարավորություն: \n" +
                "Ուրեմն\n" +
                "Ճկունություն զարգացնելու համար սկսեք անհարմար հարցերից:\n" +
                "«Ո՞ր գաղափարի հետ եմ ես չափազանց կապված»:\n" +
                "Դա կարող է լինել ռազմավարություն, որոշում, շաբլոն ՝ մի բան, որն «անձեռնմխելի» է թվում: \n" +
                "«Իսկ եթե բացառենք այդ գաղափարի հնարավորությունը, ապա ի՞նչ» ։ \n" +
                "Պատկերացրեք, որ ձեր «միակ ճիշտ ուղին» այլևս գոյություն չունի: \n" +
                "Ի՞նչ քայլեր կձեռնարկեիք: Ի՞նչ գաղափարներ հանկարծ ընդունելի կդառնան: \n" +
                "«Ին՞չ այլ ուղիներ կարող են ինձ տանել նույն նպատակին»:\n" +
                "Ճկունությունը նպատակից հրաժարվելը չէ, այլ ճանապարհը փոխելու ունակություն է, եթե նախկինն այլևս առաջ չի տանում: \n" +
                "Երբեմն տեղաշարժվելու համար անհրաժեշտ է ոչ թե ավելի շատ ջանք, այլ ավելի շատ դիտանկյուններ: \n" +
                "\n" +
                "Մինիմաքսում ճկունությունը աշխատելաոճ է։Մենք կսովորեցնենք Ձեր բիզնեսին լինել ճկուն։",
        },
        {
            img: "public/images/blogsIImages/robotic_hand_atom.png",
            title: "Նորարարություն",
            desk: "․ Բիզնեսը պահանջում է ոչ թե միլիոններ այլ համարձակություն\n" +
                "Երբ խոսում են նորարարության մասին, ամենից հաճախ պատկերացնում են տեխնոլոգիական ստարտափները մայրաքաղաքում կամ համաշխարհային ընկերությունները։ Բայց նորարարության իրական ուժն այն է, որ դա հասանելի է բոլորին: Նույնիսկ ամենափոքր քաղաքում, նույնիսկ գյուղում, որտեղ, կարծես, ամեն ինչ «հին ձևով» է: Այստեղ է, որ նորարարությունը դառնում է ոչ թե շքեղություն, այլ գոյատևման և աճի ռազմավարություն:\n" +
                "Ինչու է դա կարևոր:\n" +
                "Մարզերում փոքր և միջին բիզնեսը տնտեսական կայունության հիմքն է ։ Բայց առանց ճկունության, թվայնացման, նոր լուծումների, նրանք ռիսկի են դիմում հետ մնալ, կորցնել կամ մնալ փոքրաթիվ հաճախորդների շրջանում :\n" +
                "Ինչը կարող է լինել նորարարություն գյուղում/փոքր համայնքներում: \n" +
                "-Տեղական ֆերմերների համար առցանց առևտրի իրականացում \n" +
                "- Դաշտերի մոնիտորինգի համար անօդաչու թռչող սարքերի օգտագործումը\n" +
                "- Թվային վճարային համակարգեր նույնիսկ գյուղական խանութներում \n" +
                "- Հաշվառման, պատվերների, հաճախորդների բազաների ավտոմատացում\n" +
                "Նորարարությունը միայն տեխնոլոգիա չէ: Երբեմն դա նոր մտածողություն է, առաքման նոր եղանակ, նոր փաթեթավորում, ծառայության նոր ձև: Այն ամենը, ինչը թույլ է տալիս ավելի լավ անել սովորական գործը:\n" +
                "\n" +
                "Ինչն է խանգարում նորարար լինուն․\n" +
                "- Զգացողություն, որ «մեզ դա պետք չէ» , «մեզ մոտ դա չի աշխատի» \n" +
                "- Վախ անճանաչելիից \n" +
                "- Տեղեկատվության և աջակցության բացակայություն։\n" +
                "Հենց այդ պատճառով կարևոր է խոսել դրանց մասին, օրինակներ ցույց տալ, ապահովել գիտելիքի հասանելիությունը։ Օգնել բիզնեսին հավատալ, որ փոփոխությունները հնարավոր են և դրանք ոչ թե միլիոններ են պահանջում, այլ միայն համարձակություն:\n" +
                "Մինիմաքսում նորարարությունը ընտրություն է։ Մենք կօգնենք Ձեր բիզնեսին բացել նոր սահմաններ՝ կիրառելով նորարարական մոտեցումներ։"
        },
                {
                    img: "/images/telegram_mini_app_store.png",
                    title: "Telegram Mini App",
                    desk: " Ձայն, որ լսելի է՝ Telegram ծանուցումների ուժը բիզնեսի համար\n" +
                        "Երբ հաճախորդը մոռանում է կատարած գնումը, երբ զամբյուղում թողնում է ապրանքը, երբ Ձեր առաջարկը չի հասնում ճիշտ պահին… Դուք կորցնում եք հնարավորությունը։ Բայց հիմա այլևս ոչ։\n" +
                        "Telegram ծանուցումները՝ դա ուղղակի հիշեցում չէ։ Դա Ձեր բրենդի կենդանի շնչառությունն է։\n" +
                        "Ինչու է դա կարևոր․\n" +
                        "Մարդիկ հոգնել են էլ․նամակներից։ Նրանք չեն կարդում SMS-ները։ Բայց Telegram-ում նրանք ակտիվ են։ Այն արագ է, անմիջական և անհատական։ Իսկ ճիշտ ժամանակին ուղարկված ծանուցումը կարող է ոչ միայն հիշեցնել, այլև վաճառել։\n" +
                        "Ինչ կարող եք անել Telegram ծանուցումների միջոցով․\n" +
                        "Հիշեցնել՝ «Ձեր զամբյուղում ապրանք կա»\n" +
                        "Շնորհավորել՝ «Ծննդյան օրն է, ահա նվերը»\n" +
                        "Խթանել՝ «Մինչև երեկո՝ 20% զեղչ հենց Ձեզ համար»\n" +
                        "Տեղեկացնել՝ «Ձեր պատվերը ճանապարհին է»\n" +
                        "Կրկնավաճառել՝ «Ձեզ կարող է հետաքրքրել նաև այս ապրանքը»\n" +
                        "Ինչ ենք անում մենք՝ Mini4Maxi-ում․\n" +
                        "Մենք կապում ենք Ձեր բիզնեսը Telegram-ի հետ։ Կառուցում ենք խելացի ծանուցման համակարգ՝ ըստ հաճախորդի վարքագծի։ Դուք որոշում եք մեսիջները՝ մենք ավտոմատացնում ենք հոսքը։\n" +
                        "Արդյունքը․\n" +
                        "Ավելի շատ վերադառնալու հավանականություն\n" +
                        "Բարձրացված վաճառքներ\n" +
                        "Հաճախորդների հետ ավելի խորը կապ\n" +
                        "Mini4Maxi-ում մենք չենք առաջարկում ուղղակի գործիքներ։ Մենք առաջարկում ենք նոր լեզու՝ Ձեր բիզնեսի և հաճախորդների միջև։\n" +
                        "Telegram ծանուցումները հենց այդ լեզուն են՝ արագ, ուղիղ, հստակ։\n" +
                        "Հաջորդ հոդվածում կխոսենք, թե ինչպես կարող է QR կոդը դառնալ ոչ միայն տեխնոլոգիա, այլ գովազդային կամուրջ Ձեր ապրանքի և հաճախորդի միջև։",
                },
                {
                    img: "/images/blogsIImages/people_speech_bubbles.png",
                    title: "Անձնական շփում զանգվածային աշխարհում.",
                    desk: "Անձնական շփում զանգվածային աշխարհում. Telegram ծանուցումների ուժը\n" +
                        "Ձեր հաճախորդը սթորիներ է նայում, նամակներ ստանում, զանգերի է արձագանքում։ Նա կենդանի է, շարժվում է, զգում է։ Ու երբ նրա հեռախոսը ձայն է հանում ու գրում՝\n" +
                        "«Մինչև կեսգիշեր՝ հատուկ առաջարկ հենց Ձեզ համար»,\n" +
                        "դա զանգ է ոչ թե զանգվածային մարքեթինգի, այլ՝ շփման։\n" +
                        "Telegram ծանուցումները չեն նյարդայնացնում՝ դրանք լսվում են։\n" +
                        "Նրանք անմիջական են, արագ և չեն կորում սպամի կույտերում։\n" +
                        "Նոր ապրանք եկավ – ասել՝ միանգամից ծանուցել։\n" +
                        "Զեղչ սկսվեց – թոփ հաճախորդը արդեն գիտի։\n" +
                        "Դադարեց ծառայությունը – նախապես զգուշացրիք, ու վստահությունն ուժեղացավ։\n" +
                        "Բիզնեսի ձայնը լսելի է, երբ նա ճիշտ ալիքում է խոսում։\n" +
                        "Մինիմաքսում մենք դարձնում ենք ծանուցումները ոչ թե ֆունկցիա, այլ հաղորդակցման արվեստ։",
                },
                {
                    img: "public/images/blogsIImages/open_door_icon_no_bg.png",
                    title: "Երբ մի կոդը կարող է բացել դուռ.",
                    desk: "Երբ մի կոդը կարող է բացել դուռ. QR-ը որպես արագ գործողության ստեղն\n" +
                        "Սեղանի վրա սև-սպիտակ նկարի նման մի բան է դրված։ Անցորդը մի պահ նայում է, դուրս բերում հեռախոսը ու սկանավորում։\n" +
                        "3 վայրկյան հետո նա արդեն ձեր կայքում է, ձեր Telegram մինի-հավելվածում կամ հատուկ առաջարկի էջում։\n" +
                        "Սա պարզ QR կոդ չէ։\n" +
                        "Սա կարճ ճանապարհ է վաճառքի, կապի և վստահության միջև։\n" +
                        "Ռեստորան ե՞ք՝ մեկ սկան, և մենյուն բաց է։\n" +
                        "Խանութ ե՞ք՝ QR-ն տանում է ձեր օնլայն խանութ կամ զեղչի էջ։\n" +
                        "Ծառայություն եք մատուցում՝ օգտագործեք այն հաճախորդի արձագանքի, բրոնավորման կամ հարցման համար։\n" +
                        "Նկարը կարող է կախված լինել պատին, փակցված լինել մեքենայի վրա, փաթեթի մեջ դրված կամ էջի ստորին հատվածում, բայց այն պետք է բացի մի բան, ինչը հետաքրքիր է, պարզ է ու անմիջական։\n" +
                        "QR կոդը աշխատում է, երբ այն ունի նպատակ։\n" +
                        "Ու այդ նպատակը պետք է լինի վայրկենային գործողություն՝ առանց ավելորդ քայլերի։\n" +
                        "Մինիմաքսում մենք ցույց կտանք, թե ինչպես QR կոդը դարձնել՝ ոչ թե գրաֆիկա, այլ՝ փորձառություն։\n" +
                        "Սա ոչ թե «ժամանակակից ձև» է, այլ ժամանակ խնայող լուծում, որը օգնում է՝\n" +
                        "ապահովել վաճառք, ներգրավել հաճախորդ, տալ վստահություն։\n" +
                        "Սա ոչ թե ուղղակի տեխնիկա է, այլ շփման նոր մշակույթ։",
                },
                {
                    img: "public/images/blogsIImages/binary_background.png",
                    title: "Տեսնել ավելին, քան թիվը",
                    desk: "Տեսնել ավելին, քան թիվը. երբ տվյալները սկսում են խոսել\n" +
                        "Ձեր բիզնեսը խոսում է ամեն օր։\n" +
                        "Յուրաքանչյուր այց, կտտոց, հեռացում կամ վերջացված պատվեր՝ դա լեզու է։\n" +
                        "Սակայն հարցն այն է՝ արդյո՞ք դուք լսում եք։\n" +
                        "Սովորական կայքում դուք գուցե տեսնում եք այցելությունները։\n" +
                        "Բայց երբ սկսում եք հետևել՝\n" +
                        "ո՞վ է բացել հավելվածը\n" +
                        "ո՞ր բաժնից են դուրս եկել\n" +
                        "ո՞ր ապրանքը են երկար դիտել\n" +
                        "ի՞նչ պահին են հեռացել՝ դուք սկսում եք հասկանալ ոչ թե թվեր, այլ շարժում։\n" +
                        "Այդտեղ է սկսվում ճիշտ որոշումների փուլը։\n" +
                        "Օրինակ․\n" +
                        "Մի նայեք միայն, թե քանի մարդ է տեսել առաջարկը։\n" +
                        "Դիտեք, թե որ կետում դադարել են։ Արդյո՞ք գինը վախեցրել է։\n" +
                        "Գուցե նկարներն էին քիչ համոզիչ։\n" +
                        "Թե՞ պետք էր փոքր հրահրիչ՝ «պատվիրի՛ր հիմա և ստացի՛ր նվեր»։\n" +
                        "Դա է անում ճիշտ տվյալների վերլուծությունը՝\n" +
                        "դուք այլևս չեք գուշակում, այլ տեսնում եք՝ ինչ է իրականում աշխատում։\n" +
                        "Մինիմաքսում մենք ցույց ենք տալիս ձեր թվերի լեզուն։\n" +
                        "Ու դա նշանակում է՝\n" +
                        "Ավելի ճիշտ մարքեթինգային պլան\n" +
                        "Արդյունավետ վաճառքի քայլեր\n" +
                        "Ավելի բարձրաստիճան վստահություն հաճախորդի նկատմամբ։\n" +
                        "Տվյալները միայն հաշվետվություն չեն։\n" +
                        "Դրանք խորհուրդներ են, որոնք ասում են՝ «այստեղ ուժեղացրու, այստեղ՝ փոփոխիր»։\n" +
                        "Երբ տեսնում ես ճիշտը՝ կարող ես անել ճիշտը։\n" +
                        "Բիզնեսը դադարում է լինել անհայտ ուղի։ Այն դառնում է պատասխանի սպասող խնդիր։",
                },
                ];

                return (
                <div className="blog">
                    {blogMap.map((item, index) => (
                        <div
                            key={index}
                            className="blogCard"
                            onClick={() => navigate("/oneBlog", {state: item})}
                        >
                            <img src={item.img} alt={item.title}/>
                            <div className="blogText">
                                <h3>{item.title}</h3>

                            </div>
                        </div>
                    ))}
                </div>
                );
                }
